Repository: JVisi/projekt_labor
Catalog: lib/l10n/app_*.arb
Languages: hu

# greeting
source: Good morning ma'am
hu: Jóreggelt tanárnő!

# error
source: Ooops, something broke
hu: Hoppá... Valami nem jó

# reloadBtn
source: Reload
hu: Újratölt

# loading
source: Now Loading...
hu: Betöltés...

# email
source: Email address
hu: Email cím

# lengthWarning
source: Must be at least 3 characters
hu: Minimum 3 karakter legyen

source: Password
hu: Jelszó

# saveLogin
source: Save login data
hu: Adatok mentése

# loginBtn
source: Login!
hu: Belépés!

# regBtn
source: Register
hu: Regisztráció

# fillCredsWarning
source: Fill all the fields!
hu: Minden mezőt töltsön ki

# noAccount_Login
source: Don't have an account? Create one here!
hu: Nincs fiókja? Készítsen egyet!

# noAccount_Reg
source: Already have an account? Sign in!
hu: Már van fiókja? Lépjen be!

source: Username
hu: Felhasználónév

source: Password Again!
hu: Jelszó újra

# passwordMatch
source: Passwords should match!
hu: A jelszavaknak egyezni kell

source: Load books
hu: Könyvek

# wishlistEmpty
source: Wishlist is empty!
hu: A kívánságlista üres!

source: Scan barcode
hu: vonalkód olvasó

source: My Books
hu: Könyeim

source: Settings
hu: Beállítások

# alertDialogTitle
source: Warning!
hu: Figyelem!

# alertDialogText
source: This book is not in storage
hu: Ez a könyv nem található

# alertDialog_AlreadyRated
source: You already rated this book!
hu: Már értékelte ezt a könyvet!

# alertDialog_Wishlisted
source: It's on your wishlist now!
hu: Kívánságlistára rakva!

# alertDialog_AlreadyOnWishlist
source: You already wishlisted this book!
hu: Már a kívánságlistán van!

# alertDialog_Rated
source: Thank you, you rated this book!
hu: Köszönjük az értékelést!

# alertDialog_Error
source: Error
hu: Hiba

# alertDialog_OK
source: Success!
hu: Siker!

# alertDialog_Ratebtn
source: Rate this book
hu: Értékeld ezt a könyvet

# empty
source: Oops, nothing's here...
hu: Hoppá, itt még semmi sincs...

# wishlistBook_Btn
source: Put on wishlist
hu: Kívánságlistához adás

# logout
source: Logout and close
hu: Kilépés és bezárás

# given_stars
source: Given stars by users
hu: Mások értékelései

# star_label
source: star
hu: csill.
